In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:root@localhost/

In [3]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [4]:
%%sql
use uber

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [5]:
%%sql
CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_amount DECIMAL(10,2),
    order_date DATE
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [6]:
%%sql
INSERT INTO orders (order_id, customer_id, order_amount, order_date)
VALUES
(101, 1, 5000.00, '2025-01-01'),
(102, 2, 10000.00, '2025-01-02'),
(103, 3, 3000.00, '2025-01-03'),
(104, 4, 1500.00, '2025-01-04'),
(105, 1, 7000.00, '2025-01-05'),
(106, 5, 8000.00, '2025-01-06');

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[]

In [7]:
%%sql
CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    city VARCHAR(50)
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [8]:
%%sql
INSERT INTO customers (customer_id, customer_name, city)
VALUES
(1, 'Ravi Kumar', 'Chennai'),
(2, 'Priya Sharma', 'Bangalore'),
(3, 'Arjun Mehta', 'Hyderabad'),
(4, 'Meena Gupta', 'Mumbai'),
(5, 'Karthik Raj', 'Chennai');

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[]

In [11]:
%%sql
-- basic structure of subquery
select 
customer_name,
(select max(order_amount) from orders) as max_order_amount
from customers

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('Ravi Kumar', Decimal('10000.00')),
 ('Priya Sharma', Decimal('10000.00')),
 ('Arjun Mehta', Decimal('10000.00')),
 ('Meena Gupta', Decimal('10000.00')),
 ('Karthik Raj', Decimal('10000.00'))]

In [18]:
%%sql
-- subquery in where condition
select customer_name from customers
where customer_id in (
    select distinct customer_id from orders
    where order_amount > 5000
);

 * mysql+pymysql://root:***@localhost/
3 rows affected.

[('Ravi Kumar',), ('Priya Sharma',), ('Karthik Raj',)]

### EXISTS
* Checks whether a subquery returns at least one row and returns TRUE or FALSE based on that
* oru column irunthalum fulla a antha table a return pannum apdi illaina ethayume return pannathu

In [19]:
%%sql
select customer_name 
from customers
where exists (
    select * from customers where city = 'chennai'
                            );

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('Ravi Kumar',),
 ('Priya Sharma',),
 ('Arjun Mehta',),
 ('Meena Gupta',),
 ('Karthik Raj',)]

In [22]:
%%sql
-- instead of joins we use subquery for small tables
select 
    customer_name,
    city,
    (select sum(order_amount)
    from orders o  
    where o.customer_id = c.customer_id) as total_orders
from customers c;

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('Ravi Kumar', 'Chennai', Decimal('12000.00')),
 ('Priya Sharma', 'Bangalore', Decimal('10000.00')),
 ('Arjun Mehta', 'Hyderabad', Decimal('3000.00')),
 ('Meena Gupta', 'Mumbai', Decimal('1500.00')),
 ('Karthik Raj', 'Chennai', Decimal('8000.00'))]

In [38]:
%%sql
-- this alice is used for an temperory table it wont stored in the system
select customer_name from
(select * from customers) as name;

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('Ravi Kumar',),
 ('Priya Sharma',),
 ('Arjun Mehta',),
 ('Meena Gupta',),
 ('Karthik Raj',)]

In [42]:
%%sql
-- in case statement
select 
    customer_name,
    case
        when (select sum(order_amount) from orders where orders.customer_id=customers.customer_id)>
             (select avg(order_amount) from orders) then 'Above Average'
        else 'Below Average'
    end as order_category
from customers

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('Ravi Kumar', 'Above Average'),
 ('Priya Sharma', 'Above Average'),
 ('Arjun Mehta', 'Below Average'),
 ('Meena Gupta', 'Below Average'),
 ('Karthik Raj', 'Above Average')]

### Views
* It does not store the actual data it only stores the query

In [49]:
%%sql
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    email VARCHAR(100),
    hire_date DATE,
    job_title VARCHAR(50),
    salary DECIMAL(10, 2)
);

INSERT INTO employees (
    employee_id,
    first_name,
    last_name,
    email,
    hire_date,
    job_title,
    salary
)
VALUES
(1, 'John', 'Doe', 'john.doe@example.com', '2022-05-01', 'Software Engineer', 85000.00),
(2, 'Jane', 'Smith', 'jane.smith@example.com', '2023-03-15', 'Data Scientist', 92000.00),
(3, 'Alice', 'Johnson', 'alice.johnson@example.com', '2024-05-01', 'Engineer', 95000.00),
(4, 'Mark', 'Taylor', 'mark.taylor@example.com', '2022-11-15', 'Manager', 100000.00),
(5, 'Gowtham', 'sb', 'mark.taylor@example.com', '2022-11-15', 'Data Engineer', 100000.00),
(6, 'Peter', 'sb', 'mark.taylor@example.com', '2022-11-15', 'Data Engineer', 120000.00);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
6 rows affected.

[]

In [51]:
%%sql
create view first as
select  first_name from employees
where salary >90000;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [53]:
%%sql
select * from first;

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('Jane',), ('Alice',), ('Mark',), ('Gowtham',), ('Peter',)]

## Joins

In [54]:
%%sql
CREATE TABLE Restaurants (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    location VARCHAR(100)
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [55]:
%%sql 
INSERT INTO Restaurants (id, name, location)
VALUES
(1, 'ABC Bistro', 'New York'),
(2, 'The Foodie', 'Los Angeles'),
(3, 'Tasty Treat', 'Chicago');

 * mysql+pymysql://root:***@localhost/
3 rows affected.

[]

In [60]:
%%sql
drop table if exists orders ;
CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    restaurant_id INT,
    order_date DATE
)

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [62]:
%%sql
INSERT INTO orders (order_id, restaurant_id, order_date)
VALUES
(1, 1, '2023-01-01'),
(2, 1, '2023-01-02'),
(3, 2, '2023-01-05'),
(4, 4, '2023-01-07');

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[]

### Inner join or Join
* it takes only both of the table commen content alone

In [67]:
%%sql
select r.name,o.order_date
from Restaurants r 
join orders o on r.id = o.restaurant_id

 * mysql+pymysql://root:***@localhost/
3 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 1)),
 ('ABC Bistro', datetime.date(2023, 1, 2)),
 ('The Foodie', datetime.date(2023, 1, 5))]

### Left Join
* it takes both of the table commen content and left side content

In [69]:
%%sql
select r.name,o.order_date
from Restaurants r 
left join orders o on r.id = o.restaurant_id

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 2)),
 ('ABC Bistro', datetime.date(2023, 1, 1)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 ('Tasty Treat', None)]

### Inner Right Join
* it takes both of the table commen content and right side content

In [71]:
%%sql
select r.name,o.order_date
from Restaurants r 
right join orders o on r.id = o.restaurant_id

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 1)),
 ('ABC Bistro', datetime.date(2023, 1, 2)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 (None, datetime.date(2023, 1, 7))]

## Full Join
* the full join is not available for the MYSQL but we can achive this via LEFT JOIN + RIGHT JOIN + UNION OF BOTH THE JOINS

## Self Join
* to join the same table itself

In [73]:
%%sql
DROP TABLE IF EXISTS Employees;

CREATE TABLE Employees (
    id INT PRIMARY KEY,
    name VARCHAR(100) NOT NULL,
    manager_id INT NULL
);

INSERT INTO Employees (id, name, manager_id) VALUES
(1, 'Alice', 3),
(2, 'Bob', 3),
(3, 'Charlie', NULL),
(4, 'Diana', 3);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.
4 rows affected.

[]

In [88]:
%%sql
select *
from Employees e
left join Employees m
on e.manager_id = m.id;

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[(1, 'Alice', 3, 3, 'Charlie', None),
 (2, 'Bob', 3, 3, 'Charlie', None),
 (3, 'Charlie', None, None, None, None),
 (4, 'Diana', 3, 3, 'Charlie', None)]

In [87]:
%%sql
select 
    e.name,
    m.name
from Employees e
left join Employees m
on e.manager_id = m.id;

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[('Alice', 'Charlie'),
 ('Bob', 'Charlie'),
 ('Charlie', None),
 ('Diana', 'Charlie')]